'''
กฤษฎาได้ถูกคุณแม่ไหว้วานให้ล้างจานกองเป็นภูเขา  แต่ทว่ากฤษฎาก็ได้สังเกตเห็นว่าจานแต่ละใบนั้นมีน้ำหนักที่แตกต่างกัน 
และบนจานยังมีตัวเลขอีกด้วย  กฤษฎาได้เหม่อลอยเนื่องจากครุ่นคริสว่าตัวเลขนั้นหมายถึงอะไร  กฤษฎาก็ได้ทำจานหลุดมือจนจานแตก  
และเมื่อจานแตกได้มีเสียงที่มีความถี่ตามเลขบนจาน  กฤษฎาจึงนึกสนุกได้นำจานขนาดต่างๆและมีความถี่ต่างกันมาวางซ้อนๆกัน  
โดยถ้าหากนำจานที่มีน้ำหนักมากกว่ามาวางบนจานที่มีน้ำหนักน้อยกว่า จะทำให้จานที่มีน้ำหนักน้อยกว่า แตก !!! 
และจะแตกไปเรื่อยๆจนกว่าจานใบด้านล่างจะมีน้ำหนักเท่ากันหรือมากกว่า หรือจนกว่าจะไม่มีจานด้านล่างมารองรับแล้ว

ให้น้องๆเขียนโปรแกรมอ่านลำดับของจานที่กฤษฎาได้วางลงไปโดยให้ใส่จานทีละใบ  ซึ่งรวมถึงขนาดของจานและความถี่ของจาน  
จากนั้นให้หาว่าลำดับของความถี่ของจานที่ได้ยินเมื่อวางจานลงไปตามนั้นแล้วจะเป็นเช่นใด

อธิบาย Input : จะมีแค่รูปแบบเดียวคือ   < a  b >  โดยที่  a = น้ำหนักของจาน  ,  b = ความถี่ของจาน
1. Enter Input : 1 10,5 20,3 30,3 40,4 50
    10
    40
    30
2. Enter Input : 90 8,68 99,44 3,44 102,50 2
    102
    3
'''

class Stack:
    def __init__(self):
        self.item = []
    
    def is_Empty(self):
        return len(self.item) == 0
    
    def pop(self):
        if self.is_Empty():
            return -1
        return self.item.pop()
    
    def push(self,new):
        self.item.append(new)

    def size(self):
        return len(self.item)
    
    def peek(self):
        return self.item[-1]
    
    def __str__(self) -> str:
        return ''.join(self.item)
    
values = input('Enter Input : ').split(',')
result = Stack()

for i in values:
    w =  i.split()[0]
    while result.is_Empty() == False and int(result.peek().split()[0]) < int(w):
        print(result.peek().split()[1])
        result.pop()
    
    result.push(i)
    