class Stack ():
    def __init__(self, ls = None):
        if ls is None:
            self.stack = []
        else:
            self.stack = ls
            
    def push(self, i):
        self.stack.append(i)    
            
    def pop(self):
        return self.stack.pop()
    
    def peek(self):
        return None if self.isempty() else self.stack[-1]
            
    def isempty(self):
        if self.stack == []:
            return  True
        else:
            return False
        
    def size(self):
        return len(self.stack)
    
    
def forest(lst):
    trees = Stack()
    for i in lst:
        cmd = i.split(" ")
        if cmd[0] == "A":
            trees.push(int(cmd[1]))
        elif cmd[0] == "B":
            #look back
            count = 0
            max_height = -1
            for h in reversed(trees.stack):
                if h > max_height:
                    count += 1
                    max_height = h
            print(count)
        elif cmd[0] == "S":
            #effect of  mushroom
            toxic_trees = []
            for h in trees.stack:
                if h % 2 == 0:
                    toxic_height = max(1, h - 1)
                else:
                    toxic_height = h + 2
                toxic_trees.append(toxic_height)
            trees.stack = toxic_trees

inp = [e for e in input("Enter Input : ").split(",")]
forest(inp)



'''
<<<  กฤษฎาจำเป็นต้องเดินทางไกลเข้าไปในป่าเนื่องจากเป็นหลักสูตรของลูกเสือสามัญ  แต่กฤษฎาได้หลงทางเข้ามาในป่าลึก (เดินยังไงให้หลงครับเนี่ยย - -") หลังจากเดินไปสักพักกฤษฎาก็ได้สังเกตเห็นเลขบนต้นไม้แต่ละต้น ซึ่งเป็นตัวเลขที่แสดงความสูงของต้นไม้แต่ละต้น (มีหน่วยเป็นเมตร) กฤษฎาจึงคิดอะไรสนุกๆทำเพื่อแก้เบื่อโดยการเดินไปเรื่อยๆ และจำความสูงของต้นไม้แต่ละต้น และจะหันกลับมามอง ต้นไม้ที่เคยเดินผ่านไป >>>

****  ด้านบนจะเป็นเนื้อหาของ  < วันหนึ่งฉันเดินเข้าป่า   version  1 >  เผื่อน้องบางคน Random ไม่ได้ครับ


หลังจากกฤษฎาเดินหลงป่ามาได้สักพักก็ได้ไปเจอเห็ดสีสันสวยงามจึงได้หยิบขึ้นมากิน  หลังจากกินเข้าไปทำให้กฤษฎามีอาการแปลกๆเกิดขึ้น  เนื่องจากเห็ดที่กินเข้าไปเป็นเห็ดพิษ  แต่กฤษฎาก็ยังคอยนับความสูงต้นไม้ไปเรื่อยๆเหมือนเดิม  ผลข้างเคียงจากเห็ดพิษก็ได้ส่งผลกระทบต่อการนับต้นไม้ของกฤษฎาเนื่องจากอาการหลอนประสาท ทำให้ต้นไม้ที่มีความสูงเป็นเลขคี่มีการเพิ่มความสูงมา 2 เมตร และต้นไม้เลขคู่ลดความสูงไป  1 เมตร ความสูงที่น้อยที่สุดคือ 1 เมตร

ให้น้องๆเขียนโปรแกรมเพื่อรับความสูงของต้นไม้ที่กฤาฎาได้เดินผ่าน  แล้วหาว่าเมื่อกฤษฎาหันหลังกลับมามองจะเห็นต้นไม้กี่ต้น

อธิบาย Input :  A  <Heights>  แสดงถึงความสูงของต้นไม้  ,  B  คือการหันหลังกลับมามอง , S  คือการโดนผลกระทบจากเห็ดพิษ

อธิบาย Test Case แรก : กฤษฎาจะเดินผ่านต้นไม้ความสูง  4   ก่อนแล้วตามด้วย  3   แล้วหันหลังกลับมามองจะเห็นต้นไม้ 2 ต้น ต่อมาเดินไปเจอต้นไม้สูง  5  กับ ต้นไม้สูง 8 ตามลำดับ  แล้วหันหลังกลับมามองจะเห็นแค่ต้นไม้ต้นเดียว  เนื่องจากต้น 8 เมตรบังต้นไม้ความสูง  4  3  และ  5 

โดยจะรับประกันว่าจะมีต้นไม้อย่างน้อย 1 ต้นและมีการหันกลับมาอย่างน้อย 1 ครั้ง


testcase 1
Enter Input : A 4,A 3,B,A 5,A 8,B
2
1

testcase 2
Enter Input : A 4,A 3,B,S,B,A 5,A 8,B
2
1
1


'''